blog/5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-12 Mon 23:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 1.2.3</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 1.2.3
<br />
<span class="subtitle">2022-12-12 Mon</span>
</h1>
<p>
This section of SICP introduces the concept of <i>order of growth</i>. A
concept used ``to obtain a gross measure of the resources required by
process as the inputs become larger''.
</p>

<p>
The order of growth of a linear recursive process &#x2014; like that
provided by the first example of process to compute factorial at
p. 32 &#x2014; is \(\Theta(n)\) in time as well as in space.
</p>

<p>
The order of growth of a linear iterative process &#x2014; like that
provided by the second example of process to compute factorial at
p. 34 &#x2014; is \(\Theta(n)\) in time, but \(\Theta(1)\) in space.
</p>

<p>
The tree-recursive process to compute Fibonacci (p. 37) required
\(\Theta(\varphi^n)\) and spacee \(\Theta(n)\), where \(\varphi\) is the
golden ratio.
</p>

<div id="outline-container-org2f38d1f" class="outline-2">
<h2 id="org2f38d1f">Exercise 1.14</h2>
<div class="outline-text-2" id="text-org2f38d1f">
<p>
Exercise:
</p>
<blockquote>
<p>
Draw the tree illustrating the process generated by the count-change
procedure of 1.2.2 in making change for 11 cents. What are the orders
of growth of the space and number of steps used by this process as the
amount to be changed increases?
</p>
</blockquote>

<p>
Answer:
</p>

<p>
Analogously to what shown at page 38 with respect to <code>fib</code>, we can
represent tree generated by <code>count-change</code> in the following way:
</p>
<pre class="example">
                                           (count-change 11)
                                              (cc 11 5)
                                              /       \
                                      (cc 11 4)      (cc - 39 5)
                                      /      \             \
                                 (cc 11 3)  (cc -14 4)      0
                                  /      \         \
                             (cc 11 2)  (cc 1 3)    0
                             /     \      /     \
                    (cc 11 1) (cc 6 2) (cc 1 2) (cc -9 3)
                    ___|      /\____     |_____          \
                ___/   |     |      |    |____ \_______   \_____
               |       |     |       \        |        |        |
       (cc 11 0) (cc 10 1) (cc 6 1) (cc 1 2) (cc 1 1) (cc -4 2) 0
       ___/   ____/ |         /\        |\         |_________    \__________
 _____/   ___|     /         /  \       | \_____   \_______  |______        |
|        |        /         /   |       |       |          |        |       |
0 (cc 10 0) (cc 9 1) (cc 6 0) (cc 5 1) (cc 1 1) (cc -4 2) (cc 1 0) (cc 0 1) 0
     /       /\        /      / \         |\____     \       |      |
  __/     __/  \      /      /   \        |     \___  \_____ |      |
 |       /      |    |      /     \       |         |      | |      |
 0 (cc 9 0) (cc 8 1) 0 (cc 5 0) (cc 4 1) (cc 1 0) (cc 0 1) 0 0      1         
     |          /\          |        |\__       \   |
     |         /  \         |        |   \       \  |
     0  (cc 8 0)  (cc 7 1)  0  (cc 4 0) (cc 3 1) 0  1
         |          /\          |          /\     
         |         /  \         |         /  \
         0  (cc 7 0)  (cc 6 1)  0  (cc 3 0)  (cc 2 1)
              |          /\          |          /\
              |         /  \         |         /  \
              0  (cc 6 0)  (cc 5 1)  0  (cc 2 0)  (cc 1 1)
                  /        /\           /         /\
                 /        /  \         |         /  \
                0  (cc 5 0)  (cc 4 1)  0  (cc 1 0) (cc 0 1)
                     |          /\           |        |
                     |         /  \          |        |
                     0  (cc 4 0)  (cc 3 1)   0        1
                           |           /\
                           |          /  \
                           0   (cc 3 0)  (cc 2 1)
                                  |           /\ 
                                  |          /  \
                                  0   (cc 2 0)  (cc 1 1)
                                         |           /\
                                         |          /  \ 
                                         0   (cc 1 0)  (cc 0 1)
                                                 |        |
                                                 0        1  
</pre>
<p>
This looks like a tree recursive processe like that of <code>fib</code>. And
</p>
<blockquote>
<p>
In general, the number of steps required by a tree-recursive process
will be proportional to the number of nodes in the tree, while the
space required will be proportional to the maximum depth of the tree
(p.39).
</p>
</blockquote>

<p>
So I'm inclined to say the order of growth in time is \(\Theta(n^2)\)
and the order of growth in space is \(\Theta(n)\). After having had a
look around, though, the situation seems more controversial than it
prima facie seemed&#x2026; I'll try to go back to this at a future time.
</p>
</div>
</div>

<div id="outline-container-org4a9afa7" class="outline-2">
<h2 id="org4a9afa7">Exercise 1.15</h2>
<div class="outline-text-2" id="text-org4a9afa7">
<p>
Exercise:
</p>
<blockquote>
<p>
The sine of an angle (specified in radians) can be computed by making
use of the approximation \(\sin x \approx x\) if \(x\) is sufficiently
small, and the trigonometric identity
</p>

<p>
\(\sin x = 3 \sin \frac{x}{3} - 4 \sin^3 \frac{x}{3}\)
</p>

<p>
to reduce the size of the argument of \(\sin\). (For purposes of this
exercise an angle is considered ``sufficiently small'' if its
magnitude is not greater than 0.1 radians.) These ideas are
incorporated in the following procedures:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">cube</span> x) (* x x x))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">p</span> x) (- (* 3 x) (* 4 (cube x))))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">sine</span> angle)
  (<span style="color: #b9ca4a;">if</span> (not (&gt; (abs angle) 0.1))
      angle
      (p (sine (/ angle 3.0)))))
</pre>
</div>

<ol class="org-ol">
<li>How many times is the procedure p applied when <code>(sine 12.15)</code> is
evaluated?</li>
<li>What is the order of growth in space and number of steps (as a
function of <code>a</code>) used by the process generated by the <code>sine</code>
procedure when <code>(sine a)</code> is evaluated?</li>
</ol>
</blockquote>

<p>
Answer:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">cube</span> (x) (* x x x))
(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">p</span> (x) (- (* 3 x) (* 4 (cube x))))
(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">sine</span> (angle)
  (<span style="color: #b9ca4a;">if</span> (not (&gt; (abs angle) 0.1))
      angle
    (p (sine (/ angle 3.0)))))


(sine 12.15) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">-0.39980345741334</span>
(p (sine (/ 12.15 3.0)))
(p (sine 4.05))
(p (p (sine (/ 4.05 3.0))))
(p (p (sine 1.3499999999999999)))
(p (p (p (sine (/ 1.3499999999999999 3.0)))))
(p (p (p (sine 0.44999999999999996))))
(p (p (p (p (sine (/ 0.44999999999999996 3.0))))))
(p (p (p (p (sine 0.15)))))
(p (p (p (p (p (sine (/ 0.15 3.0)))))))
(p (p (p (p (p (sine 0.049999999999999996))))))
(p (p (p (p (p (sine 0.049999999999999996))))))
(p (p (p (p (p 0.049999999999999996)))))
(p (p (p (p (- (* 3 0.049999999999999996) (* 4 (cube 0.049999999999999996)))))))
(p (p (p (p 0.1495))))
(p (p (p 0.4351345505)))
(p (p 0.9758465331678772))
(p -0.7895631144708228)
(- -2.3686893434124685 -1.9688858859991285)
-0.39980345741334  
</pre>
</div>
<ol class="org-ol">
<li>We can see that procedure <code>p</code> is applied five times.</li>

<li><p>
I tentatively thought that the order of growth in space and time
was O(n).
</p>

<p>
However I've looked around at other people's solutions and that is
not right. The order of growth is better than linear; it's
logarithmic, O(log(n)); more specifically O(log<sub>3</sub>(n)). I
definitively need to revive my math skills, hoping they still exist
somewhere.
</p>

<p>
This was one of the most intuitive explanations I've found of why
the order of growth is what it is: ``the amount of times <code>p</code> is
evaluated is incremented by one for every tripling of <code>a</code>. [&#x2026;] As
for the order of growth regarding space, it should be the same as
for the number of steps, because for each additional step, there is
exactly one more function call that the system must keep track of''.
(<a href="https://www.timwoerner.de/posts/sicp/exercises/1/15/">https://www.timwoerner.de/posts/sicp/exercises/1/15/</a>)
</p></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
